app/Controllers/Admin.php

   public function index()
    {
        $db = \Config\Database::connect();

        // 1. Hitung total permintaan berstatus 'PENDING' dari tabel t_permohonan
        try {
            $totalPending = $db->table('t_permohonan')
                               ->where('status', 'PENDING')
                               ->countAllResults();
        } catch (\Exception $e) {
            $totalPending = 0;
        }

        // 2. Ambil barang yang hampir habis dari tabel m_barang (stok di bawah atau sama dengan 5)
        try {
            $stokTipis = $db->table('m_barang')
                            ->where('stok <=', 5)
                            ->orderBy('stok', 'ASC')
                            ->get(3)
                            ->getResultArray();
        } catch (\Exception $e) {
            $stokTipis = [];
        }

        // 3. Ambil 4 permintaan terbaru dari tabel t_permohonan
        try {
            $permintaanTerbaru = $db->table('t_permohonan')
                                    ->orderBy('id_permohonan', 'DESC') // Pastikan primary key-mu sesuai
                                    ->get(4)
                                    ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `t_permohonan`
WHERE `status` = 'PENDING'
SELECT *
FROM `m_barang`
WHERE `stok` <= 5
ORDER BY `stok` ASC
 LIMIT 3
SELECT *
FROM `t_permohonan`
ORDER BY `id_permohonan` DESC
 LIMIT 4

    public function master_barang() {
        $model = new BarangModel();
        $data = [
            'title' => 'Master Barang',
            'barang' => $model->findAll(),
---
SELECT *
FROM `m_barang`

    public function review_nota() {
    $fileNota = $this->request->getFile('nota');
    if ($fileNota === null || ! $fileNota->isValid()) {
        return redirect()->to(base_url('admin/tambah_stok'))->with('error', 'Upload gagal!');
    }

    $namaFile = $fileNota->getRandomName();
    $fileNota->move('uploads/nota/', $namaFile);
    $pathFoto = FCPATH . 'uploads/nota/' . $namaFile;

    $hasil_teks = "";
    try {
        $ocr = new \thiagoalessio\TesseractOCR\TesseractOCR($pathFoto);
        $ocr->executable('C:\Program Files\Tesseract-OCR\tesseract.exe');
        $hasil_teks = $ocr->run();
    } catch (\Exception $e) {
        $hasil_teks = "";
    }

    $hasil_deteksi = [];
    // PASTIKAN: tabel m_barang punya kolom 'satuan' dan 'stok'
    $semua_barang = $this->db->table('m_barang')->get()->getResultArray();
---
SELECT *
FROM `m_barang`

    public function simpan_stok_final() {
        $id_barang = $this->request->getPost('id_barang');
        $jumlah_masuk = $this->request->getPost('qty'); // Pastikan di View namanya qty[]

        if (empty($id_barang) || !is_array($id_barang)) {
            return redirect()->to(base_url('admin/tambah_stok'))->with('error', 'Tidak ada data barang yang disimpan.');
        }

        for ($i = 0; $i < count($id_barang); $i++) {
            $id = $id_barang[$i];
            $qty = $jumlah_masuk[$i] ?? 0;

            if (!empty($id) && $qty > 0) {
                $barang = $this->db->table('m_barang')->where('id_barang', $id)->get()->getRowArray();
                if ($barang) {
                    $stok_baru = $barang['stok'] + $qty;
                    $this->db->table('m_barang')->where('id_barang', $id)->update(['stok' => $stok_baru]);
---
SELECT *
FROM `m_barang`
WHERE `id_barang` = '10'
UPDATE `m_barang` SET `stok` = 168
WHERE `id_barang` = '10'

    public function manajemen_user() {
        $model = new UserModel();
        $data = [
            'title' => 'Manajemen User',
            'nama' => session()->get('nama'),
            'users' => $model->where('role', 'user')->findAll()
---
SELECT *
FROM `users`
WHERE `role` = 'user'

public function cetak_berita_acara()
{
    // Mengambil nomor nota dari input GET (URL)
    $no_nota = $this->request->getGet('no_nota');

    // 1. QUERY TRANSAKSI UTAMA
    // Mencari berdasarkan kolom 'no_permintaan'
    $transaksi = $this->db->table('t_permohonan')
        ->join('users', 'users.id_user = t_permohonan.id_user', 'left')
        ->where('no_permintaan', $no_nota)
        ->get()->getRowArray();
---
SELECT *
FROM `t_permohonan`
LEFT JOIN `users` ON `users`.`id_user` = `t_permohonan`.`id_user`
WHERE `no_permintaan` = 'FP/TSM/C02'